/**
*  @description： 作者端注册组件
*  @author： zhangchenle
*  @data:  2018.6.2
*/
<template>
  <div class="register">
    <Dialog v-if="showProtocol" @close="closeProtocol" :width="width" >
      <div class="mask-title">千氪用户注册协议</div>
      <div class="mask-block">
        <p>欢迎您使用千氪财经软件及相关服务！</p>
        <p >
          为了更好地为您提供服务，请您仔细阅读《千氪用户注册协议》（以下简称“本协议”）。在您开始使用“千氪”软件及相关服务之前，请您务必认真阅读并充分理解本协议，特别是涉及免除或者限制责任的条款、权利许可和信息使用的条款、同意开通和使用特殊单项服务的条款、法律适用和争议解决条款等。其中，免除或者限制责任条款等重要内容将以加粗形式提示您注意，您应重点阅读。如您未满18周岁，请您在法定监护人陪同下仔细阅读并充分理解本协议，并征得法定监护人的同意后下载本软件。
        </p>
        <p>
          除非您完全接受本协议的全部内容，否则您无权下载、安装、注册、登录、使用（以下统称“使用”）“千氪”软件，或者通过任何方式使用“千氪”服务，或者获得“千氪”软件提供的任何服务 （本协议中统称“使用”）。若您使用“千氪”软件及相关服务，则视为您已充分理解本协议并承诺作为本协议的一方当事人接受协议的约束。
        </p>
        <h3>1、适用范围</h3>
        <p>1.1 本协议是您与成都千氪网络科技有限公司（以下简称“公司”）之间就您下载、安装、注册、登录、使用“千氪”软件，并获得“千氪”软件提供的相关服务所订立的协议。就本协议项下涉及的某些服务，可能会由公司的关联公司、控制公司向您提供，您知晓并同意接受上述服务内容，即视为接受双方之间的相关权利义务关系亦受本协议约束。</p>
        <p>1.2 “用户”指所有直接或间接获取和使用“千氪”软件及相关服务的使用者，包括自然人、法人和其他组织等。在本协议中称为“用户”或称“您”。</p>
        <p>1.3 “千氪”指由公司合法拥有并运营的、标注名称为“千氪”的客户端应用程序以及“千氪”（www.kg.com ）的网站，公司向用户提供信息平台展示个性化信息等功能，提供连接人与信息的新型服务。</p>
        <p>1.4 本协议内容同时包括公司已经发布及后续可能不断发布的关于“千氪”软件及相关服务的相关协议、规则等内容。前述内容一经正式发布，并以适当的方式送达用户（网站公布、系统通知等），即为本协议不可分割的组成部分，您应同样遵守。</p>
        <h3>2、使用“千氪”软件及相关服务</h3>
        <p>2.1 您使用“千氪”软件及相关服务，可以通过预装、公司已授权的第三方下载等方式获取“千氪”客户端应用程序或访问千氪相关网站。若您并非从公司或经公司授权的第三方获取本软件的，公司无法保证非官方版本的“千氪”软件能够正常使用，您因此遭受的损失与公司无关。</p>
        <p>2.2 公司可能为不同的终端设备开发了不同的应用程序软件版本，您应当根据实际设备状况获取、下载、安装合适的版本。</p>
        <p>2.3 您可根据自行需要使用“千氪”软件及相关服务或更新“千氪”版本，如您不再需要使用“千氪”软件及相关服务可自行卸载。</p>
        <p>2.4 为更好的提升用户体验及服务，公司将不定期提供软件更新或改变（包括但不限于软件修改、升级、功能强化、开发新服务、软件替换等）。为保证“千氪”软件及相关服务安全、提升用户服务，本软件及相关服务更新或部分服务内容更新后，在可能的情况下，公司将以包括但不限于系统提示、公告、站内信等方式提示用户，用户有权选择接受更新版本或服务，如用户不接受，部分功能将受到限制或不能继续使用。</p>
        <p>2.5除非得到公司事先书面授权，您不得以任何形式对“千氪”软件及相关服务进行包括但不限于改编、复制、传播、垂直搜索、镜像或交易等未经授权的访问或使用。</p>
        <p>2.6 您理解，您使用“千氪”软件及相关服务需自行准备与软件及相关服务有关的终端设备（如电脑、手机等），一旦您在其终端设备中打开“千氪”软件或访问“千氪”相关网站，即视为您使用“千氪”软件及相关服务。为充分实现“千氪”的全部功能，您可能需要将其终端设备联网，您理解由您承担所需要的费用（如流量费、上网费等）。</p>
        <p>2.7 公司许可您个人的、不可转让的、非独占地和非商业的合法使用“千氪”软件及相关服务的权利。本协议未明示授权的其他一切权利仍由公司保留，您在行使该些权利时须另行获得公司的书面许可，同时公司如未行使前述任何权利，并不构成对该权利的放弃。</p>
        <p>2.8 您无需注册即可开始使用“千氪”软件及相关服务。同时，您也理解，为使您更好地使用“千氪”软件及相关服务，保障您的账号安全，某些功能和/或某些单项服务项目，如发布文章、设置阅读奖励、提现钛值服务等，要求您按照国家相关法律法规的规定，提供真实的身份信息实名注册并登陆后方可使用。</p>
        <h3>3、关于“账号”</h3>
        <p>3.1 “千氪”为用户提供了注册通道，用户有权选择合法的字符组合作为自己的账号，并自行设置符合安全要求的密码。用户设置的账号、密码是用户用以登录并以注册用户身份使用“千氪”软件及相关服务的凭证。</p>
        <p>
          3.2 您理解并承诺，您所设置的账号不得违反国家法律法规及公司的相关规则，您的账号名称、头像和简介等注册信息及其他个人信息中不得出现违法和不良信息，未经他人许可不得用他人名义（包括但不限于冒用他人姓名、名称、字号、头像等足以让人引起混淆的方式）开设账号，不得恶意注册“千氪”账号（包括但不限于频繁注册、批量注册账号等行为）。您在账号注册及使用过程中需遵守相关法律法规，不得实施任何侵害国家利益、损害其他公民合法权益，有害社会道德风尚的行为。公司有权对您提交的注册信息进行审核。
        </p>
        <p>
          3.3 您在“千氪”中的注册账号所有权及有关权益均归公司所有，您完成注册手续后仅享有该账号的使用权。您的账号仅限于您本人使用，未经公司书面同意，禁止以任何形式赠与、借用、出租、转让、售卖或以其他方式许可他人使用该账号。如果公司发现或者有合理理由认为使用者并非账号初始注册人，公司有权在未通知您的情况下，暂停或终止向该注册账号提供服务，并有权注销该账号，而无需向注册该账号的用户承担法律责任。
        </p>
        <p>
          3.4 您有责任维护个人账号、密码的安全性与保密性，并对您以注册账号名义所从事的活动承担全部法律责任，包括但不限于您在“千氪”上进行的任何数据修改、言论发表、款项支付等操作行为。您应高度重视对账号与密码的保密，在任何情况下不向他人透露账号及密码。若发现他人未经许可使用您的账号或发生其他任何安全漏洞问题时，您应当立即通知公司。
        </p>
        <p>
          3.5 您的账号在丢失或遗忘密码后，可遵照公司的申诉途径及时申诉请求找回账号或密码。您理解并认可，公司的密码找回机制仅需要识别申诉单上所填资料与系统记录资料具有一致性，而无法识别申诉人是否系真正账号有权使用者。公司特别提醒您应妥善保管您的账号和密码。当您使用完毕后，应安全退出。因您保管不当可能导致遭受盗号或密码丢失，责任由您自行承担。
        </p>
        <p>
          3.6 在注册、使用和管理账号时，您应保证注册账号时填写的身份信息的真实性，请您在注册、管理账号时使用真实、准确、合法、有效的相关身份证明材料及必要信息（包括您的姓名及电子邮件地址、联系电话、联系地址等）。依照国家相关法律法规的规定，为使用本软件及服务，您需要填写真实的身份信息，请您按照相关法律规定完成实名认证，并注意及时更新上述相关信息。若您提交的材料或提供的信息不准确、不真实、不合法或者公司有理由怀疑为错误、不实或不合法的资料，则公司有权拒绝为您提供相关服务或您可能无法使用“千氪”软件及相关服务或在使用过程中部分功能受到限制。
        </p>
        <p>
          3.7 除自行注册“千氪”账号外，用户也可授权使用其合法拥有的包括但不限于公司和/或其关联公司、控制公司其他软件用户账号，以及实名注册的第三方软件或平台用户账号注册并登录使用“千氪”软件及相关服务，但第三方软件或平台对此有限制或禁止的除外。当用户以前述已有账号登录使用的，应保证相应账号已进行实名注册登记，同样适用本协议中的相关约定。
        </p>
        <p>
          3.8 您理解并同意，除您登录、使用“千氪”软件及相关服务外，您还可以用“千氪”账号登录使用公司及其关联公司、控制公司提供的其他软件、服务。您以“千氪”账号登陆并使用前述服务的，同样应受实际服务提供方的《用户协议》及其他协议条款约束。
        </p>
        <p>
          3.9 为提高您内容曝光量及发布效率，您同意您在本软件/网站的账号及相应账号所发布的全部内容均授权本公司以您的账号自动同步发布至公司及/或关联公司及/或控制公司运营的系列客户端软件及网站。您在本软件/网站发布、修改、删除内容的操作，均会同步到上述系列客户端软件及网站。 您通过已注册或者已同步的账号登录公司及/或关联公司及/或控制公司运营的系列客户端软件产品及网站时（如有），应遵守该软件产品及网站自身的《用户协议》及其他协议条款的规定。
        </p>
        <p>
          3.10 因您自身原因或其他不可抗因素而导致账号被盗、丢失，均由您本人承担责任，公司不承担任何责任。
        </p>
        <p>
          3.11 您理解，为了充分使用账号资源，如您在注册后未及时进行初次登录使用或连续超过二个月未登录账号并使用等情形，公司有权收回您账号。
        </p>
        <h3>
          4、用户个人信息保护
        </h3>
        <p>4.1 公司与用户一同致力于用户个人信息（即能够独立或与其他信息结合后识别用户身份的信息）的保护，保护用户个人信息是公司的基本原则之一。</p>
        <p>4.2 公司将运用与“千氪”软件及相关服务相匹配的安全技术及其他安全措施并建立完善的管理制度来保护您的个人信息。</p>
        <p>4.3 您可随时浏览、修改自己提交的个人身份信息，您理解并同意出于安全性和身份识别（如账号或密码找回申诉服务等）的考虑，您可能无法修改注册时提供的初始注册信息及其他验证信息。</p>
        <p>4.4 公司不会将您的个人信息转移或披露给第三方，除非：
          （1） 事先获得您的明确授权；
          （2） 您分享的信息；
          （3） 根据有关的法律法规规定或按照司法、行政等国家机关的要求；
          （4） 出于实现公司向您提供服务所必需的目的，向公司的关联方、控制方、合作伙伴分享提供服务所必需的个人信息，公司及其关联方、控制方、合作伙伴无权将共享的个人信息用于任何其他用途；
          （5） 以维护公共利益或学术研究为目的；
          （6） 为维护“千氪”其他用户、公司及其关联公司、控制公司的合法权益，例如查找、预防、处理欺诈或安全方面的问题；
          （7） 公司为维护合法权益而向用户提起诉讼或仲裁；
          （8） 在涉及合并、分立、收购、资产转让或类似的交易时，如涉及到个人信息转让，公司会要求新的持有您的个人信息的公司、组织继续受本隐私政策的约束，否则，公司有权要求该公司、组织重新取得您的授权同意；
          （9） 符合本协议相关条款的规定。

        </p>
        <p>
          4.5 请您注意勿在使用“千氪”软件及相关服务中透露自己的各类财产账户、银行卡、信用卡、第三方支付账户及对应密码等重要资料，否则由此带来的任何损失由您自行承担。您不应将个人信息通过“千氪”上发表、上传或扩散。
        </p>
        <h3>5、 用户行为规范</h3>
        <p>5.1 用户行为要求</p>
        <p>您应当对您使用本产品及相关服务的行为负责，除非法律允许或者经公司事先书面许可，您使用“千氪”软件及相关服务不得具有下列行为：
        </p>
        <p>  5.1.1 使用未经公司授权或许可的任何插件、外挂、系统或第三方工具对“千氪”软件及相关服务的正常运行进行干扰、破坏、修改或施加其他影响。
        </p>
        <p>
          5.1.2 利用或针对“千氪”软件及相关服务进行任何危害计算机网络安全的行为，包括但不限于：
          （1）非法侵入他人网络、干扰他人网络正常功能、窃取网络数据等危害网络安全的活动；
          （2）提供专门用于从事侵入网络、干扰网络正常功能及防护措施、窃取网络数据等危害网络安全活动的程序、工具；
          （3）明知他人从事危害网络安全的活动的，为其提供技术支持、广告推广、支付结算等帮助
          （4）使用未经许可的数据或进入未经许可的服务器/账号；
          （5）未经允许进入公众计算机网络或者他人计算机系统并删除、修改、增加存储信息；
          （6）未经许可，企图探查、扫描、测试“千氪”系统或网络的弱点或其它实施破坏网络安全的行为；
          （7）企图干涉、破坏“千氪”系统或网站的正常运行，故意传播恶意程序或病毒以及其他破坏干扰正常网络信息服务的行为；
          （8）伪造TCP/IP数据包名称或部分名称。
        </p>
        <p>5.1.3 对“千氪”软件进行反向工程、反向汇编、编译或者以其他方式尝试发现本软件的源代码。
        </p>
        <p>5.1.4 恶意注册“千氪”账号，包括但不限于频繁、批量注册账号。</p>
        <p> 5.1.5 违反法律法规、本协议、公司的相关规则及侵犯他人合法权益的其他行为。
          在任何情况下，如果公司有理由认为您的任何行为违反或可能违反上述约定的，公司可独立进行判断并处理，且在任何时候有权在进行任何事先通知的情况下终止向用户提供服务，并追究相关责任。</p>
        <p>5.2 信息内容规范</p>
        <p> 5.2.1 用户按规定完成实名认证后，可以以注册账号或“千氪”合作平台账号登录“千氪”发布内容、跟帖评论等。</p>
        <p>5.2.2 公司致力使跟帖评论成为文明、理性、友善、高质量的意见交流。在推动跟帖评论业务发展的同时，不断加强相应的信息安全管理能力，完善跟帖评论自律，切实履行社会责任，遵守国家法律法规，尊重公民合法权益，尊重社会公序良俗。
        </p>
        <p>
          5.2.3 用户评论、发布、传播的内容应自觉遵守宪法法律、法规、遵守公共秩序，尊重社会公德、社会主义制度、国家利益、公民合法权益、道德风尚和信息真实性等要求。用户不得制作、复制、发布、传播法律、行政法规禁止的下列信息内容：
          （1）反对宪法确定的基本原则的；
          （2）危害国家安全，泄露国家秘密的；
          （3）颠覆国家政权，推翻社会主义制度、煽动分裂国家、破坏国家统一的；
          （4）损害国家荣誉和利益的；
          （5）宣扬恐怖主义、极端主义的；
          （6）宣扬民族仇恨、民族歧视，破坏民族团结的；
          （7）煽动地域歧视、地域仇恨的；
          （8）破坏国家宗教政策，宣扬邪教和迷信的；
          （9）编造、散布谣言、虚假信息，扰乱经济秩序和社会秩序、破坏社会稳定的；
          （10）散布、传播暴力、淫秽、色情、赌博、凶杀、恐怖或者教唆犯罪的；
          （11）危害网络安全、利用网络从事危害国家安全、荣誉和利益的；
          （12）侮辱或者诽谤他人，侵害他人合法权益的；
          （13）对他人进行暴力恐吓、威胁，实施人肉搜索的；
          （14）涉及他人隐私、个人信息或资料的；
          （15）散布污言秽语，损害社会公序良俗的；
          （16）侵犯他人隐私权、名誉权、肖像权、知识产权等合法权益内容的；
          （17）散布商业广告，或类似的商业招揽信息、过度营销信息及垃圾信息；
          （18）使用本网站常用语言文字以外的其他语言文字评论的；
          （19）与所评论的信息毫无关系的；
          （20）所发表的信息毫无意义的，或刻意使用字符组合以逃避技术审核的；
          （21）其他违反法律法规、政策及公序良俗、干扰“千氪”正常运营或侵犯其他用户或第三方合法权益内容的其他信息。
        </p>
        <p>
          5.3 公司设立公众投诉、举报平台，用户可按照公司公示的投诉举报制度向公司投诉、举报各类违法违规行为、违法传播活动、违法有害信息等内容，公司将及时受理和处理用户投诉举报，以共同营造风清气正的网络空间。
        </p>
        <h3>
          6、“千氪”数据使用规范
        </h3>
        <p>
          6.1 未经公司书面许可，用户不得自行或授权、允许、协助任何第三人对本协议“千氪”软件及相关服务中信息内容进行如下行为：
          （1）复制、读取、采用“千氪”软件及相关服务的信息内容，用于包括但不限于宣传、增加阅读量、浏览量等商业用途；
          （2）擅自编辑、整理、编排“千氪”软件及相关服务的信息内容后在“千氪”软件及相关服务的源页面以外的渠道进行展示；
          （3）采用包括但不限于特殊标识、特殊代码等任何形式的识别方法，自行或协助第三人对“千氪”软件及相关服务的的信息或内容产生流量、阅读量引导、转移、劫持等不利影响；
          （4）其他非法获取“千氪”软件及相关服务的信息内容的行为。

        </p>
        <p>
          6.2 经公司书面许可后，用户对“千氪”软件及相关服务的信息和内容的分享、转发等行为，还应符合以下规范：
          （1）对抓取、统计、获得的相关搜索热词、命中率、分类、搜索量、点击率、阅读量等相关数据，未经公司事先书面同意，不得将上述数据以任何方式公示、提供、泄露给任何第三人；
          （2）不得对“千氪”软件及相关服务的源网页进行任何形式的任何改动，包括但不限于“千氪”软件及相关服务的首页（profile页面）链接，广告系统链接等入口，也不得对“千氪”软件及相关服务的源页面的展示进行任何形式的遮挡、插入、弹窗等妨碍；
          （3）应当采取安全、有效、严密的措施，防止“千氪”软件及相关服务的信息内容被第三方通过包括但不限于“蜘蛛”（spider）程序等任何形式进行非法获取；
          （4）不得把相关数据内容用于公司书面许可范围之外的目的，进行任何形式的销售和商业使用，或向第三方泄露、提供或允许第三方为任何方式的使用。
          （5）用户向任何第三人分享、转发、复制“千氪”软件及相关服务信息内容的行为，还应遵守公司为此制定的其他规范和标准。
        </p>
        <h3>7、违约处理</h3>
        <p>7.1 针对您违反本协议或其他服务条款的行为，公司有权独立判断并视情况采取预先警示、拒绝发布、立即停止传输信息、删除跟帖、短期禁止发言、限制账号部分或者全部功能直至永久关闭账号等措施。公司有权公告处理结果，且有权根据实际情况决定是否恢复使用。对涉嫌违反法律法规、涉嫌违法犯罪的行为将保存有关记录，并依法向有关主管部门报告、配合有关主管部门调查。
        </p>
        <p>7.2因您违反本协议或其他服务条款规定，引起第三方投诉或诉讼索赔的，您应当自行承担全部法律责任。因您的违法或违约行为导致公司及其关联公司、控制公司向任何第三方赔偿或遭受国家机关处罚的，您还应足额赔偿公司及其关联公司、控制公司因此遭受的全部损失。
        </p>
        <p>
          7.3公司尊重并保护法人、公民的知识产权、名誉权、姓名权、隐私权等合法权益。您保证，在使用“千氪”软件及相关服务时上传的文字、图片、视频、音频、链接等不侵犯任何第三方的知识产权、名誉权、姓名权、隐私权等权利及合法权益。否则，公司有权在收到权利方或者相关方通知的情况下移除该涉嫌侵权内容。针对第三方提出的全部权利主张，您应自行承担全部法律责任；如因您的侵权行为导致公司及其关联公司、控制公司遭受损失的（包括经济、商誉等损失），您还应足额赔偿公司及其关联公司、控制公司遭受的全部损失。
        </p>
        <h3>8、服务的变更、中断和终止</h3>
        <p>
          8.1 您理解并同意，公司提供的“千氪”软件及相关服务是按照现有技术和条件所能达到的现状提供的。公司会尽最大努力向您提供服务，确保服务的连贯性和安全性。您理解，公司不能随时预见和防范技术以及其他风险，包括但不限于不可抗力、病毒、木马、黑客攻击、系统不稳定、第三方服务瑕疵及其他各种安全问题的侵扰等原因可能导致的服务中断、数据丢失以及其他的损失和风险。
        </p>
        <p>
          8.2 您理解并同意，公司为了服务整体运营的需要，有权在公告通知后修改、中断、中止或终止“千氪”软件及相关服务，而无须向用户负责或承担任何赔偿责任。
        </p>
        <h3>9、广告</h3>
        <p>9.1 您使用“千氪”软件及相关服务过程中，充分理解并同意：本服务中可能包括公司针对个人或企业推出的信息、广告发布或品牌推广服务，您同意公司有权在“千氪”软件及相关服务中展示“千氪”软件及相关服务相关和/或第三方供应商、合作伙伴的商业广告、推广或信息（包括商业或非商业信息）。</p>
        <p>9.2 如您不同意该广告，您有权选择关闭该广告信息；“千氪”推送通知服务的，您有权自行关闭该服务或可停止使用“千氪”软件及相关服务。</p>
        <p>
          9.3 公司依照法律规定履行广告及推广相关义务，您应当自行判断该广告或推广信息的真实性和可靠性并为自己的判断行为负责。除法律法规明确规定外，您因该广告或推广信息进行的购买、交易或因前述内容遭受的损害或损失，用户应自行承担，公司不予承担责任。
        </p>
        <h3>10、知识产权</h3>
        <p>10.1公司在“千氪”软件及相关服务中提供的内容（包括但不限于软件、技术、程序、网页、文字、图片、图像、音频、视频、图表、版面设计、电子文档等）的知识产权属于公司所有。公司提供本服务时所依托的软件的著作权、专利权及其他知识产权均归公司所有。未经公司许可，任何人不得擅自使用（包括但不限于通过任何机器人、蜘蛛等程序或设备监视、复制、传播、展示、镜像、上载、下载“千氪”软件及相关服务中的内容）。
        </p>
        <p>10.2 您理解并同意，在使用“千氪”软件及相关服务时发布上传的文字、图片、视频、音频等均由您原创或已获合法授权。您通过“千氪”上传、发布的任何内容的知识产权归属您或原始著作权人所有。
        </p>
        <p>
          10.3您知悉、理解并同意您通过“千氪”发布上传的内容，授权公司及其关联公司、控制公司可在全球范围内、免费、非独家、可转授权地使用，使用范围包括但不限于在当前或其他网站、应用程序、产品或终端设备等，并授权公司及其关联公司、控制公司对相应内容可进行修改、复制、改编、翻译、汇编或制作衍生产品。
        </p>
        <p>
          10.4您确认并同意授权公司以公司自己的名义或委托专业第三方对侵犯您上传发布的享有知识产权的内容进行代维权，维权形式包括但不限于：监测侵权行为、发送维权函、提起诉讼或仲裁、调解、和解等，公司有权对维权事宜做出决策并独立实施。
        </p>
        <p>
          10.5 公司为“千氪”开发、运营提供技术支持，并对“千氪”软件及相关服务的开发和运营等过程中产生的所有数据和信息等享有全部权利。
        </p>
        <p>
          10.6 请您在任何情况下都不要私自使用公司的包括但不限于“千氪网络”、“千氪”、“千氪”、“kg.com”和“KG.COM”等在内的任何商标、服务标记、商号、域名、网站名称或其他显著品牌特征等（以下统称为“标识”）。未经公司事先书面同意，您不得将本条款前述标识以单独或结合任何方式展示、使用或申请注册商标、进行域名注册等，也不得实施向他人明示或暗示有权展示、使用、或其他有权处理该些标识的行为。由于您违反本协议使用公司上述商标、标识等给公司或他人造成损失的，由您承担全部法律责任。
        </p>
        <h3>
          11、隐私政策
        </h3>
        <p>“千氪”非常重视用户信息的保护，在使用“千氪”软件及相关服务前，请您务必仔细阅读本隐私政策，公司可能会收集和使用您的相关信息，您一旦选择使用“千氪”软件及相关服务，即意味着同意公司按照本隐私政策收集、使用（含商业合作使用）、储存您的相关信息。
        </p>
        <p>11.1 信息可能收集的范围与方式</p>
        <p>11.1.1 公司提供服务时，可能会收集、储存和使用下列与您有关的信息。如果您不提供相关信息，可能无法注册成为“千氪”的用户或无法享受公司提供的某些服务，或者无法达到相关服务拟达到的效果。</p>
        <p>
          11.1.2 您理解并同意当您使用“千氪”软件及相关服务时填写和/或提供的信息，可能包括姓名、性别、联系方式等单独或者结合识别用户身份的信息。您可以选择不提供某一或某些信息，但是这样可能使您无法使用“千氪”的相关特殊服务。
        </p>
        <p>11.2 因您使用“千氪”软件及相关服务获取的信息</p>
        <p>11.2.1 日志信息
          （1）当您使用“千氪”产品或服务时，为使您获得更轻松的访问体验，公司可能会使用各种技术来收集和存储信息，在此过程中可能会向您的设备发送一个或多个Cookie或匿名标识符。这么做是为了了解您的使用习惯，使您省去重复输入注册信息等步骤，或帮助判断您的账户安全。
          （2）当您使用“千氪”产品或服务时，公司可能会利用Cookie和同类技术收取您的信息用于了解您的偏好，进行咨询或数据分析，改善产品服务即用户体验，提高广告效果，及时发现并防范安全风险，为用户和合作伙伴提供更好的服务。
          （3）公司不会将Cookie用于本隐私政策所述目的之外的任何用途，您可以根据自己的偏好留存或删除Cookie。您可清除软件或网页中保存的所有Cookie，当您手动清除后，您的相关信息即已删除。
        </p>
        <p>11.2.2 设备或应用信息，某些移动设备或应用包含唯一应用程序编号。例如您使用的移动设备、浏览器或您使用的用于接入“千氪”服务的其他程序所提供的配置信息、设备版本号和设备识别码、IP地址等。为了提供更好的服务与改善用户体验，公司可能会记录硬件型号、操作系统版本号、国际移动设备身份码（IMEI）、网络设备硬件地址（MAC）等信息。
        </p>
        <p>11.2.3 位置信息，当您开启设备定位功能并使用“千氪”基于位置提供的相关服务时，系统会通过GPS或WiFi等方式自动处理有关设备的位置信息，以使得您不需要手动输入自身地理坐标就可获得相关服务。您可以通过关闭定位功能，停止告知“千氪”软件关于您的地理位置（大多数移动设备将允许您关闭定位服务，具体建议您联系您的移动设备的服务商或生产商）。
        </p>
        <p>11.3 信息使用</p>
        <p>11.3.1 通过使用收集的信息，公司会得以向您提供个性化的服务并改善现有服务。</p>
        <p>11.3.2 通过使用收集的信息，向您提供更加相关广告以替代普遍投放的广告。
        </p>
        <p>11.3.3公司可能会与关联公司、控制公司及其他合作方共同向您提供您所要求的服务或内容。在服务或内容为该项产品/服务所必须的情况下，您同意公司可与其分享您的个人信息，并且公司将努力确保该第三方在使用您的个人信息时同时遵守本隐私政策以及其他的保密及安全义务。
        </p>
        <p>
          11.3.4 公司不对外公开或向第三方提供用户的个人信息，但下列情况除外：
          （1） 事先获得您的明确授权；
          （2） 您分享的信息；
          （3） 根据有关的法律法规规定或按照司法、行政等国家机关的要求；
          （4） 出于实现公司向您提供服务所必需的目的，向公司的关联方、控制方、合作伙伴分享提供服务所必需的个人信息，公司及其关联方、控制方、合作伙伴无权将共享的个人信息用于任何其他用途；
          （5） 以维护公共利益或学术研究为目的；
          （6） 为维护“千氪”其他用户、公司及其关联公司、控制公司的合法权益，例如查找、预防、处理欺诈或安全方面的问题；
          （7） 公司为维护合法权益而向用户提起诉讼或仲裁；
          （8） 在涉及合并、分立、收购、资产转让或类似的交易时，如涉及到个人信息转让，公司会要求新的持有您的个人信息的公司、组织继续受本隐私政策的约束，否则，公司有权要求该公司、组织重新取得您的授权同意；
          （9） 符合本协议相关条款的规定。
        </p>
        <p>11.4 信息安全</p>
        <p>11.4.1.公司非常重视信息安全，公司努力为您的信息安全提供保障，以防止您的信息被不当使用或被未经授权的访问、使用或泄漏。</p>
        <p>11.4.2公司将在合理和安全水平内使用各种安全保护措施，例如公司会使用加密技术（例如SSL）、匿名化处理等手段保护您的个人信息。</p>
        <p>11.4.3公司建立专门的数据安全部门、安全管理制度、采取流程保障您的个人信息安全。采取严格的数据使用和访问制度，采取专门的数据和技术安全审计。对个人信息泄露等安全事件，公司会启动应急预案，阻止安全事件扩大，并以推送、公告等形式告知您。
        </p>
        <p>11.4.4尽管已经采取了上述合理有效措施，并已经遵守了相关法律规定要求的标准，但请您理解，由于技术的限制以及可能存在的各种恶意手段，在互联网行业，即便竭尽所能加强安全措施，也不可能始终保证信息百分之百的安全。您需要了解，您接入公司的服务所用的系统和通讯网络，有可能因公司可控范围外的因素而出现问题。因此，您应采取积极措施保护个人信息的安全，如：定期修改密码，不将自己的账号密码等个人信息透露给他人。您知悉：“千氪”提供的个人信息保护措施仅适用于“千氪”平台，一旦您离开“千氪”，浏览或使用其他网站、服务及内容资源，“千氪”即没有能力及义务保护你在“千氪”之外的网站提交的任何个人信息，无论你登录或浏览上述网站是否基于“千氪”的链接或引导。
        </p>
        <p>11.5 本隐私政策条款不适用于以下情况：</p>
        <p>11.5.1 通过“千氪”软件及相关服务而接入的第三方服务（包括任何第三方应用及网站）收集的信息；
        </p>
        <p>11.5.2 通过在“千氪”软件及相关服务中进行广告服务的其他公司或机构、组织所收集的信息。
        </p>
        <p>
          11.6 公司的服务可能包括或链接至第三方提供的信息或其他服务（包括网站）。该等第三方服务可能由相关的第三方运营。您使用该等第三方服务（包括您向该等第三方提供的任何个人信息），须受该第三方的服务条款及隐私政策（而非本隐私政策）约束，您需要仔细阅读其条款。请您妥善保护自己的个人信息，仅在必要的情况下向他人提供。本隐私政策仅适用于公司所收集、保存、使用的信息，并不适用于任何第三方提供的服务或第三方的信息使用规则，公司对任何第三方使用由您提供的信息不承担任何责任。
        </p>
        <h3>12、免责声明</h3>
        <p>12.1 您理解并同意，“千氪”软件及相关服务可能会受多种因素的影响或干扰，公司不保证(包括但不限于)：
        </p>
        <p>
          12.1.1公司完全适合用户的使用要求；
        </p>
        <p>
          12.1.2 公司不受干扰，及时、安全、可靠或不出现错误；用户经由公司取得的任何软件、服务或其他材料符合用户的期望；
        </p>
        <p>
          12.1.3软件中任何错误都将能得到更正。

        </p>
        <p>
          12.2 对于涉嫌借款或其他涉财产的网络信息、账户密码、广告或推广等信息的，用户请谨慎对待并自行进行判断，基于前述原因您因此遭受的利润、商业信誉、资料损失或其他有形或无形损失，公司不承担任何直接、间接、附带、特别、衍生性或惩罚性的赔偿责任。
        </p>
        <p>
          12.3 用户理解并同意，在使用“千氪”软件及相关服务过程中，可能遇到不可抗力等因素（不可抗力是指不能预见、不能克服并不能避免的客观事件），包括但不限于政府行为、自然灾害、网络原因、黑客攻击、战争或任何其它类似事件。出现不可抗力情况时，公司将努力在第一时间及时修复，但因不可抗力给用户造成了损失，用户同意公司不承担责任。
        </p>
        <p>
          12.4 公司依据本协议约定获得处理违法违规内容的权利，该权利不构成公司的义务或承诺，公司不能保证及时发现违法行为或进行相应处理。
        </p>
        <p>
          12.5 用户阅读、理解并同意：关于本协议服务，公司不提供任何种类的明示或暗示担保或条件，包括但不限于商业适售性、特定用途适用性等。您对本协议软件及相关服务的使用行为必须自行承担相应风险。
        </p>
        <p>
          12.6 用户阅读、理解并同意，本协议是在保障遵守国家法律法规、维护公序良俗，保护他人合法权益，公司在能力范围内尽最大的努力按照相关法律法规进行判断，但并不保证公司判断完全与司法机关、行政机关的判断一致，如因此产生的后果用户已经理解并同意自行承担。
        </p>
        <h3>13、未成年人使用条款</h3>
        <p>13.1 若用户是未满18周岁的未成年人，应在监护人监护、指导并获得监护人同意情况下阅读本协议和使用“千氪”软件及相关服务。
        </p>
        <p>13.2 公司重视对未成年人个人信息的保护，未成年用户在填写个人信息时，请加强个人保护意识并谨慎对待，请在监护人指导时正确使用“千氪”软件及相关服务。
        </p>
        <p>13.3 未成年用户理解如因您违反法律法规、本协议内容，则您及您的监护人应依照法律规定承担因此而导致的一切后果。
        </p>
        <h3>
          14、其他
        </h3>
        <p>
          14.1 本协议的成立、生效、履行、解释及争议的解决均应适用中华人民共和国大陆地区法律。倘本协议之任何规定因与中华人民共和国大陆地区的法律抵触而无效，则这些条款将尽可能接近本协议原条文意旨重新解析，且本协议其它规定仍应具有完整的效力及效果。
        </p>
        <p>
        14.2 本协议的签署地点为中华人民共和国四川省成都市高新区，若您与公司发生争议的，双方应尽量友好协商解决，协商不成，您同意应将争议提交至四川省成都高新技术产业开发区人民法院管辖。
      </p>
        <p>
          14.3 公司有权依据国家政策、技术条件、产品功能等变化需要而进行修改本协议，公司会将修改后的协议予以发布。前述内容一经正式发布，并以适当的方式送达用户（网站公布、系统通知等），即为本协议不可分割的组成部分，您应同样遵守。您对修改后的协议有异议的，请立即停止登录、使用“千氪”软件及相关服务，若您登录或继续使用“千氪”软件及相关服务，视为认可修改后的协议。
        </p>
        <p>
          14.4 本协议中的标题仅为方便及阅读而设，并不影响本协议中任何规定的含义或解释。
        </p>
        <p>
          14.5 您和公司均是独立的主体，在任何情况下本协议不构成公司对用户的任何形式的明示或暗示担保或条件，双方之间亦不构成代理、合伙、合营或雇佣关系。
        </p>
        <p>
          14.6 本协议的版权为公司所有，公司保留一切解释和修改的权利。
      </p>
      </div>
    </Dialog>
    <Dialog v-if="showBlockMask" @close="close" :width="widthBlock">
      <div class="mask-title">验证</div>
      <Block  class="mask-block2" @sendMsg="sendMsg" :ncBlock="ncBlock"></Block>
    </Dialog>
    <Header></Header>
    <div class="main">
      <Steps :steps="steps"></Steps>
      <div class="box">
        <div class="phone">
          <Prefix :prefix="mobileArea" @setMobileArea="setMobileArea"></Prefix>
          <input  v-model="userMobile" type="number" placeholder="手机号">
          <div class="error">{{mobileError}}</div>
        </div>
        <div class="password">
          <input  v-model="checkCode" type="number" autocomplete="off" placeholder="验证码">
          <div v-if="showCountdown" class="tips">{{time}}秒后重发</div>
          <div class="tips" @click="getCheckCode" v-else>获取验证码</div>
          <div class="error">{{checkCodeError}}</div>
        </div>

        <div class="password">
          <input v-model="password" type="password" placeholder="新密码">
          <div class="error">{{passwordError}}</div>
        </div>
        <div class="password">
          <input v-model="confirmPassword" type="password" placeholder="确认密码">
          <div class="error">{{confirmPasswordError}}</div>
        </div>
        <div class="password">
          <input v-model="inviteCode" type="text" placeholder="邀请码">
          <!-- <div class="error">{{confirmPasswordError}}</div> -->
        </div>
        <div class="protocol-box">
          <div class="checkbox iconfont icon-gou" :class="{checked: isAgreed}" @click="changeChecked"></div>
          我同意并接受<span class="protocol" @click="showProtocolBox">千氪用户注册协议</span></div>

        <div  class="btn-register" ><el-button @click="register" :loading="loading" type="primary">注册</el-button></div>
        <div class="go-login">已有千氪账号？<span @click="login">去登录</span></div>
      </div>
    </div>
    <Footer></Footer>
  </div>
</template>

<script>
import Dialog from "@/components/common/Dialog"
import Block from "@/components/common/Block"
import Header from '@/components/apply/Header'
import Steps from '@/components/apply/Steps'
import Prefix from '@/components/apply/Prefix'
import Footer from '@/components/home/Footer.vue'
import Verification from "@/assets/js/util/verification"
import { mapActions } from "vuex";
export default {
  name: 'Register',
  components: { Dialog, Block, Header, Steps, Prefix, Footer },
  data() {
    return {
      // 步骤
      width: '800px',
      widthBlock: '400px',
      steps: [{
        stepno: '1', // 步骤序号
        title: '注册账号', // 步骤标题
        active: true // 步骤是否激活（已进行）
      },{
        stepno: '2',
        title: '选择类型',
        active: false
      },{
        stepno: '3',
        title: '填写资料',
        active: false
      }],
      // 发送短信验证码需要的滑块参数
      ncBlock: {
        platform: "3",
        session: '',
        sig: '',
        token: '',
        scene: ''
      },
      mobileArea: '86', // 手机前缀
      userMobile: '', // 手机号码
      checkCode: '', // 短信验证码
      nickname: '', //昵称
      password: '', //新密码
      confirmPassword: '', //确认密码
      isAgreed: false, // 是否同意协议
      showCountdown: false, // 是否显示倒计时
      time: 90, // 倒计时的时间
      showProtocol: false, // 是否显示协议
      showBlockMask: false, // 是否显示滑块
      mobileError: '', // 手机错误提示
      checkCodeError: '', // 验证码错误提示
      nicknameError: '', // 昵称错误提示
      passwordError: '', // 密码错误提示
      confirmPasswordError: '' ,// 确认密码错误提示
      loading: false,
      inviteCode:'' // 邀请码
    }
  },
  // 输入监听
  watch: {
    // 手机号码输入监听
    userMobile(newValue, oldValue){
      if(!newValue) {
        this.mobileError = "请输入手机号"
      } else {
        if(this.mobileArea === '86') {
          if(Verification.validateChinaPhone(newValue)) {
            this.mobileError = ''
          }else {
            this.mobileError = '请输入正确的手机号码'
          }
        } else {
          if(Verification.validatePhone(newValue)) {
            this.mobileError = ''
          } else {
            this.mobileError = '请输入正确的手机号码'
          }
        }
      }
    },
    // 验证码输入监听
    checkCode(newValue, oldValue){
      if(!newValue) {
        this.checkCodeError = '请输入正确的验证码'
      } else {
        this.checkCodeError = ''
      }
    },
    // 昵称输入监听
    nickname(newValue, oldValue){
      if(!newValue) {
        this.nicknameError = '昵称不能为空'
      } else {
        this.nicknameError = ''
      }
    },
    // 密码输入监听
    password(newValue, oldValue){
      if(!newValue) {
        this.passwordError = '请设置密码'
      } else if (newValue.length<6||newValue.length>20) {
        this.passwordError = '密码长度6-20位，支持数字、英文、符号'
      } else {
        this.passwordError = ''
      }
    },
    // 密码确认输入监听
    confirmPassword (newValue, oldValue) {
      if (!newValue) {
        this.confirmPasswordError = '请设置密码'
      } else if (newValue !== this.password) {
        this.confirmPasswordError = '两次输入的密码不一致'
      } else {
        this.confirmPasswordError = ''
      }
    }
  },
  mounted(){
    this.inviteCode = this.$route.query.code;
  },
  methods: {
    ...mapActions(["accountLogin", "mobileLogin"]),
    // 设置电话号码地区前缀
    setMobileArea(mobileArea) {
      this.mobileArea = mobileArea
      if(this.mobileArea === '86') {
        if(Verification.validateChinaPhone(this.userMobile)) {
          this.mobileError = ''
        }else {
          this.mobileError = '请输入正确的手机号码'
        }
      } else {
        if(Verification.validatePhone(this.userMobile)) {
          this.mobileError = ''
        } else {
          this.mobileError = '请输入正确的手机号码'
        }
      }
    },
    // 获取验证码
    getCheckCode() {
      //判断手机号是否重复
      let data  = {userMobile:this.userMobile}
      const that = this;
      this.ajax({
        url: "/common/checkMobileUse",
        data,
        success(data) {
          if(data.code === "20002") {
            that.mobileError = '该手机号已注册'
            return
          } else if(data.code === "10000"){
              // 显示验证码滑块
              if(!that.userMobile){
                that.mobileError = '请输入手机号'
              }else {
                if(!that.mobileError) {
                  that.showBlockMask = true;
                }
              }
          } else{
            that.$message({
              type: 'error',
              message: data.message
            })
          }
        }
      })

    },
    close() {
      // 隐藏验证码滑块
      this.showBlockMask = false;
    },
    // 显示倒计时
    startCountdown() {
      this.showCountdown = true
      let timer = setInterval(() => {
        this.time--;
        if(this.time==0) {
          this.showCountdown = false
          this.time = 90;
          clearInterval(timer)
        }
      }, 1000)
    },
    // 重置滑块
    resetBlock() {
      this.ncBlock.session = ''
      this.ncBlock.sig = ''
      this.ncBlock.token = ''
      this.ncBlock.scene = ''
    },
    // 发送短信
    sendMsg() {
      let that = this
      let data = Object.assign({
        verIfy: this.userMobile,
        mobileArea: this.mobileArea,
        valiDation: this.valiDation
      }, this.ncBlock)
      that.close() // 关闭蒙层
      that.startCountdown() // 开始倒计时
      that.resetBlock() // 重置滑块
      this.ajax({
        url: "/common/sendSmsCode",
        data,
        success(data) {
          if(data.code === "10000") {
            // 发送短信成功
             this.$message({
              type: 'success',
              message: "短信已发送"
            })
          } else {
            // 发送短信失败
            this.$message({
              type: 'error',
              message: "发送短信失败"
            })
          }
        }
      })
    },
    // 点击checkbox
    changeChecked() {
      this.isAgreed = !this.isAgreed
    },
    // 提交注册
    register() {
      if(!this.isAgreed) {
        this.$message({
          showClose: true,
          message: '请同意并接受千氪专栏申请协议',
          type: 'warning'
        })
      }
      let errorFlag = false;
      if (this.userMobile === '') {
        this.mobileError = '请输入手机号'
        errorFlag = true
      }
      if (this.checkCode === '') {
        this.checkCodeError = '请输入正确的验证码'
        errorFlag = true
      }
      // if (this.nickname === '') {
      //   this.nicknameError = '昵称不能为空'
      //   errorFlag = true
      // }
      if (this.password === '') {
        this.passwordError = '请设置密码'
        errorFlag = true
      }
      if (this.confirmPassword === '') {
        this.confirmPasswordError = '请设置密码'
        errorFlag = true
      }
      if(this.mobileError || this.checkCodeError || this.nicknameError || this.passwordError || this.confirmPasswordError || !this.isAgreed) {
        errorFlag = true
      }

      if(errorFlag) return
      let data = {
        userMobile: this.userMobile,
        code: this.checkCode,
        userPassword: this.password,
        confirmPassword: this.confirmPassword,
        call_method: 'adduser',
        inviteCode:this.inviteCode
      }
      this.loading= true;
      const _this = this;
      this.ajax({
        url: "/regist/adduser",
        data,
        success: data => {
          if(data.code === "10000") {
            _this.loading =false;
            _this.$message({
              type: 'success',
              message: '恭喜你，账号注册成功！'
            })

            setTimeout(() => {
              //注册成功去登陆
              _this.accountLogin({
                userMobile: _this.userMobile,
                userPassword: _this.password,
                from:'register',
                that:this,
              });
              //this.$router.push('/login') // 注册成功，跳转到登录页面
            }, 100)
          } else {
            // 发送短信失败
            _this.loading =false;
            this.$message({
              type: 'error',
              message: data.message
            })
          }
        }
      })
    },
    //打开协议弹窗
    showProtocolBox(){
      this.showProtocol = true
    },
    //关闭协议弹窗
    closeProtocol(){
      this.showProtocol = false
    },
    //去登录
    login(){
      this.$router.push('/login')
    }
  }
}
</script>

<style lang="less" scoped>
  .register {
    padding-top: 72px;
    padding-bottom: 100px;
    position: relative;
    min-height: 100%;
    .main {
      /*margin: 62px auto 0;*/
      margin:0px auto;
      padding-bottom: 100px;
      position: relative;
      width: 1200px;
      min-height: 100%;
      .box {
        padding-top: 60px;
        margin:0px auto;
        width: 300px;
        .phone {
          position: relative;
          /*margin-top: 45px;*/
          padding: 0 13px 0 67px;
          height: 40px;
          line-height: 40px;
          font-size: 14px;
          color: #333;
          border: 1px solid #EBEBEB;
          input {
            width: 100%;
            height: 100%;
            border: none;
            transform: translateY(-2px)
          }
        }
        .password {
          position: relative;
          margin-top: 20px;
          padding: 0 93px 0 13px;
          height: 40px;
          line-height: 40px;
          font-size: 14px;
          color: #333;
          border: 1px solid #EBEBEB;
          /*border-bottom: 1px solid #EBEBEB;*/
          input {
            width: 100%;
            height: 100%;
            border: none;
            transform: translateY(-2px)
          }
          .tips {
            padding-right: 13px;
            cursor: pointer;
            font-size: 12px;
            position: absolute;
            right: 0;
            top: 0;
            height: 100%;
            width: 93px;
            color: #2382EA;
            text-align: right;
            &:hover {
              color: rgba(35,130,234,.7);
            }
          }
          .countdown {
            position: absolute;
            right: 0;
            top: 0;
            width: 93px;
            height: 100%;
            z-index: 1;
            background: #2382ea;
            color: #fff;
            text-align: center;
            border-radius: 4px;
          }
        }
        .error {
          padding: 0 13px;
          position: absolute;
          top: 100%;
          left: 0;
          width: 100%;
          height: 25px;
          line-height: 25px;
          color: #FC5A5D;
          font-size: 12px;
        }
      }
      .protocol-box {
        margin-top: 30px;
        padding-left: 22px;
        position: relative;
        color: #666666;
        font-size: 12px;
        font-family:PingFangSC;
        .checkbox {
          cursor: pointer;
          position: absolute;
          top: 2px;
          left: 0;
          height: 12px;
          width: 12px;
          border: 1px solid #EBEBEB;
          border-radius: 2px;
          color: transparent;

        }
        .checked::before {
          position: absolute;
          left: -2px;
          top: -2px;
          height: 100%;
          width: 100%;
          font-size: 16px;
          color: rgba(35, 130, 234, 1);
        }
        .protocol {
          cursor: pointer;
          color: rgba(35, 130, 234, 1);
          &:hover {
            color: rgba(35, 130, 234, .7);
          }
        }
      }
      .btn-register {
        .el-button {
          background: #2382EA;
          color: #fff;
          border:none;
          margin-top: 25px;
          width: 100%;
          background: #2382EA;
          color: #fff;
          text-align: center;
          border-radius: 4px;
          cursor: pointer;
          &:hover {
            background: rgba(35,130,234,.7);
          }
        }
      }
      .go-login {
        margin-top: 24px;
        text-align: center;
        font-size:14px;
        font-family:MicrosoftYaHei;
        color:rgba(102,102,102,1);
        span {
          color:#2382EA;
          cursor: pointer;
          &:hover {
            color: rgba(35, 130, 234, .7);
          }
        }
      }
    }
    .mask-title {
      font-size: 20px;
      font-family: MicrosoftYaHei;
      color:rgba(51,51,51,1);
      text-align: center;
      height:60px;
      line-height:60px;
      border-bottom: 1px solid #E1E0E1;
    }
    .mask-block {
            margin: 30px 0px 30px 30px;
            max-height: 600px;
            overflow-y: scroll;
            p {
              text-align: justify;
              word-break: break-all;
              font-size:15px;
              font-family:MicrosoftYaHei;
              color:rgba(51,51,51,1);
              margin-bottom: 20px;
              /*line-height: 22px;*/
            }
            h3{
              margin-bottom: 20px;
            }
          }
    .mask-block2 {
      margin: 30px;
      p {
        text-align: justify;
        word-break: break-all;
        font-size:15px;
        font-family:MicrosoftYaHei;
        color:rgba(51,51,51,1);
        margin-bottom: 20px;
        line-height: 22px;
      }
    }
    .protocol {
      width:600px;
    }
  }
</style>
